CSI API ETABS v1
cLineElm.GetLoadTemperature Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetLoadTemperature(
	string Name,
	ref int NumberItems,
	ref string[] LineName,
	ref string[] LoadPat,
	ref int[] MyType,
	ref double[] Val,
	ref string[] PatternName,
	eItemTypeElm ItemTypeElm = eItemTypeElm.Element
)
Function GetLoadTemperature (
	Name As String,
	ByRef NumberItems As Integer,
	ByRef LineName As String(),
	ByRef LoadPat As String(),
	ByRef MyType As Integer(),
	ByRef Val As Double(),
	ByRef PatternName As String(),
	Optional ItemTypeElm As eItemTypeElm = eItemTypeElm.Element
) As Integer
Dim instance As cLineElm
Dim Name As String
Dim NumberItems As Integer
Dim LineName As String()
Dim LoadPat As String()
Dim MyType As Integer()
Dim Val As Double()
Dim PatternName As String()
Dim ItemTypeElm As eItemTypeElm
Dim returnValue As Integer
returnValue = instance.GetLoadTemperature(Name,
	NumberItems, LineName, LoadPat, MyType,
	Val, PatternName, ItemTypeElm)
int GetLoadTemperature(
	String^ Name,
	int% NumberItems,
	array<String^>^% LineName,
	array<String^>^% LoadPat,
	array<int>^% MyType,
	array<double>^% Val,
	array<String^>^% PatternName,
	eItemTypeElm ItemTypeElm = eItemTypeElm::Element
)
abstract GetLoadTemperature :
        Name : string *
        NumberItems : int byref *
        LineName : string[] byref *
        LoadPat : string[] byref *
        MyType : int[] byref *
        Val : float[] byref *
        PatternName : string[] byref *
        ?ItemTypeElm : eItemTypeElm
(* Defaults:
        let _ItemTypeElm = defaultArg ItemTypeElm eItemTypeElm.Element
*)
-> int
Parameters
Name
Type: System.String
NumberItems
Type: System.Int32
LineName
Type: System.String[]
LoadPat
Type: System.String[]
MyType
Type: System.Int32[]
Val
Type: System.Double[]
PatternName
Type: System.String[]
ItemTypeElm (Optional)
Type: ETABSv1.eItemTypeElm
Return Value
Type: Int32
See Also
Reference
cLineElm Interface
ETABSv1 Namespace